app/controllers/roles_controller.rb

  def index
    @roles = Role.all
---
SELECT * FROM "roles"

  def show
    @role = Role.find(params[:id])
---
SELECT * FROM "roles" WHERE ("roles"."id" = 2)

  def create
    @role = Role.new(params[:role])
    if @role.save
---
INSERT INTO "roles" ("name", "created_at", "updated_at", "description") VALUES(E'administrator', '2010-04-27 10:19:52.475018', '2010-04-27 10:19:52.475018', E'This is the administrator of the system') RETURNING "id"

  def edit
    @role = Role.find(params[:id])
---
SELECT * FROM "roles" WHERE ("roles"."id" = 1)

  def update
    @role = Role.find(params[:id])
    if @role.update_attributes(params[:role])
---
SELECT * FROM "roles" WHERE ("roles"."id" = 1)
UPDATE "roles" SET "updated_at" = '2010-04-29 14:08:09.710019', "description" = E'this is the superuser of the system' WHERE "id" = 1

  def destroy
    @role = Role.find(params[:id])
    @role.destroy
---
SELECT * FROM "roles" WHERE ("roles"."id" = 5)
DELETE FROM "roles" WHERE "id" = 5