app/controllers/taxon_concepts_controller.rb

  def create_status
    #debugger
    @status = params[:taxon_concept][:has_taxon_status]
    TaxonConcept.first.add_status @status
---
SELECT * FROM "taxon_concepts" LIMIT 1