app/controllers/taxon_concepts_controller.rb

SELECT * FROM "taxon_concepts" LIMIT 1
SELECT * FROM "taxon_names" LIMIT 1
---
   def index
    @taxon_concepts = TaxonConcept.includes(:taxon_name, :rank)