app/controllers/taxon_names_controller.rb

SELECT * FROM "taxon_names"
---
  def index
    @taxon_names = TaxonName.all

SELECT * FROM "taxon_names" WHERE ("taxon_names"."id" = 1)
---
  def show
    @taxon_name = TaxonName.find(params[:id])

INSERT INTO "taxon_names" ("authorship_year", "created_at", "scientific_name", "epithet", "updated_at", "is_usable", "genus_part", "alternative_authorship_year", "infra_epithet", "basionym_id", "basionym_authorship") VALUES('2010-05-07', '2010-05-07 11:11:30.557277', E'Loxodonta', NULL, '2010-05-07 11:11:30.557277', NULL, NULL, NULL, NULL, NULL, NULL) RETURNING "id"
---
  def create
    @taxon_name = TaxonName.new(params[:taxon_name])
    if @taxon_name.save