app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("last_request_at", "created_at", "crypted_password", "updated_at", "username", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "last_login_at", "email") VALUES('2010-04-08 14:47:14.132669', '2010-04-08 14:47:14.133307', E'fc3794834455a9b90e55b05ef96cea9b51c5d2a58abc4ac84716f74bc057ecab3fce99fb055b0567a7f5ab8dc2ccc5f65b3d205eae335d7c11b1b510a4c21477', '2010-04-08 14:47:14.133307', E'adiila', 0, E'127.0.0.1', E'PNAPrDR9Nlfjuh8GrnPk', '2010-04-08 14:47:14.102862', E'65347603ef72cf57eb6be745a9b4541d7cf4d516174c957c7d56c45d6f7934f261c18b1680b8f226f73299e130d6078d26c5d29ea7508dc0800a482064873436', 1, NULL, NULL, E'adiila@ackadij.com') RETURNING "id"