app/controllers/users_controller.rb

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = E'1') LIMIT 1